# Importación y Conexión a Base de Datos

In [1]:
pip install json5

Requirement already satisfied: json5 in d:\anaconda\lib\site-packages (0.9.5)Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install psycopg2

Requirement already satisfied: psycopg2 in d:\anaconda\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install pyodbc

Requirement already satisfied: pyodbc in d:\anaconda\lib\site-packages (4.0.0-unsupported)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#pip install pyreadstat

**_Importando paquetes necesarios_**

In [6]:
import os           #Para direccionar la ruta de trabajo 
import pandas as pd #Para archivos csv, excel,spss,stata
import numpy as np  #Para trabajar con matrices y arrays
import json5        #Para trabajar extensiones json
import pyodbc       #Para conexion al motor Sql Server
import psycopg2     #Para conexion al motor Postgresql

In [7]:
#Establecer la ruta de trabajo 
os.chdir("D:\Social Data Consulting\Python for Data Science\data")

**__Archivo JSON__**

In [8]:
ficherojson="subvenciones.json"
with open(file=ficherojson,encoding='UTF-8') as fichero:
    datajson=json5.load(fichero)

In [9]:
type(datajson)

list

In [10]:
type(datajson[0])

dict

In [11]:
datajson=pd.DataFrame(datajson)
datajson.head()

             Asociación    Actividad Subvencionada Importe en euros
0  AMPA ANTONIO MACHADO  TALLER FIESTA DE CARNAVAL            94.56
1  AMPA ANTONIO MACHADO       TALLER DIA DEL PADRE           39.04
2  AMPA ANTONIO MACHADO     TALLER DIA DE LA MADRE           43.64
3  AMPA ANTONIO MACHADO        FIESTA FIN DE CURSO          921.00
4  AMPA ANTONIO MACHADO     CONCURSO LOGOTIPO AMPA           56.57

**__Archivo EXCEL__**

In [12]:
ficheroexcel="subvenciones.xls"

In [13]:
datosexcel=pd.read_excel(io=ficheroexcel,sheet_name="Hoja1")
datosexcel.head(10)

             Asociación           Actividad Subvencionada   Importe
0  AMPA ANTONIO MACHADO          TALLER FIESTA DE CARNAVAL    94.56
1  AMPA ANTONIO MACHADO               TALLER DIA DEL PADRE    39.04
2  AMPA ANTONIO MACHADO             TALLER DIA DE LA MADRE    43.64
3  AMPA ANTONIO MACHADO                FIESTA FIN DE CURSO   921.00
4  AMPA ANTONIO MACHADO             CONCURSO LOGOTIPO AMPA    56.57
5  AMPA ANTONIO MACHADO         ASOCIACION FAPA ALCOBENDAS    80.00
6  AMPA ANTONIO MACHADO  ASOCIACION FAPA GINER DE LOS RIOS    86.79
7  AMPA ANTONIO MACHADO                  FIESTA DE NAVIDAD   660.00
8  AMPA ANTONIO MACHADO                          HALLOWEEN   168.39
9  AMPA ANTONIO MACHADO                         SAN ISIDRO   195.00

**__Archivo SPSS__**

In [14]:
ficherospss="distritos.sav"
datosspss=pd.read_spss(path=ficherospss)
datosspss.head()

     distrito  ocu_vivi  pobpjov  sinelect  sinagua  pea1619  pocprin  peam15
0         Ate      1.15      5.3     27.60    51.10      3.9      1.1   63.48
1    Barranco      1.09      4.5      1.59     8.32      0.8      3.9   33.48
2       Breña      1.08      4.4      2.20    23.15      0.9      4.0   37.89
3  Carabayllo      1.10      5.1     30.13    38.09      4.5     12.6   63.65
4       Comas      1.20      5.9     10.92    24.27      3.8      9.4   60.37

**__Archivo STATA__**

In [15]:
ficherostata="anes_timeseries_2012.dta"

In [16]:
variables=["libcpre_self","libcpo_self"]

In [17]:
datosstata=pd.read_stata(ficherostata,columns=variables)
datosstata.head()

,libcpre_self,libcpo_self
0,1. Extremely liberal,"-6. Not asked, unit nonresponse (no post-elect..."
1,1. Extremely liberal,2. Liberal
2,-2. Haven't thought much about this,2. Liberal
3,-2. Haven't thought much about this,-8. Don't know
4,2. Liberal,2. Liberal

**__Archivo CSV__**

In [18]:
ficherocsv="LL.csv"

In [19]:
datoscsv=pd.read_csv(ficherocsv,sep=",")
datoscsv.head()

,treated,age,education,black,married,nodegree,re74,re75,re78,hispanic,u74,u75
0,1,33,12,0,1,0,0.000000,0.000000,12418.070312,0,1,1
1,1,20,12,0,1,0,8644.156250,8644.156250,11656.505859,0,0,0
2,0,39,12,1,1,0,19785.320312,6608.137207,499.257202,0,0,0
3,1,49,8,0,1,1,9714.596680,7285.947754,16717.121094,0,0,0
4,0,26,8,0,1,1,37211.757812,36941.265625,30247.500000,0,0,0

**__Archivo TXT__**

In [21]:
ficherotxt="housing.data.txt"

In [22]:
datostxt=pd.read_csv(ficherotxt,header=None, sep="\s+")
datostxt.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [23]:
datostxt.columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 
              'NOX', 'RM', 'AGE', 'DIS', 'RAD', 
              'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
datostxt.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

**_Motor de DB SQL SERVER_**

In [24]:
# Parámetros
#SERVER = '69.164.192.245'
#DATABASE = 'NEPTUNO'
#UID = 'SA'
#PWD = 'SdC2019PERU!'

In [25]:
miconexion = pyodbc.connect('DRIVER={SQL Server};SERVER=69.164.192.245;DATABASE=NEPTUNO;UID=SA;PWD=SdC2019PERU!')

In [26]:
#Construimos un objeto cursor
micursor=miconexion.cursor()

In [27]:
type(micursor)

pyodbc.Cursor

In [28]:
#Ejecutar una sentencia SQL
micursor.execute('SELECT * FROM productos')

In [29]:
help(micursor.fetchall)

Help on built-in function fetchall:

fetchall(...) method of pyodbc.Cursor instance
    fetchall() --> list of Rows

    Fetch all remaining rows of a query result, returning them as a list of Rows.
    An empty list is returned if there are no more rows.

    A ProgrammingError exception is raised if the previous call to execute() did
    not produce any result set or no call was issued yet.

In [30]:
misfilas=micursor.fetchall()
misfilas[0:5]

[(1, 'Té Dharamsala', 1, 1, '10 cajas x 20 bolsas', Decimal('18'), 39, 0, 10, 0, 'Categoria D'),
 (2, 'Cerveza tibetana Barley', 1, 1, '24 - bot. 12 l', Decimal('19'), 17, 40, 25, 0, 'Categoria D'),
 (3, 'Sirope de regaliz', 1, 2, '12 - bot. 550 ml', Decimal('10'), 13, 70, 25, 0, 'Categoria D'),
 (4, 'Especias Cajun del chef Anton', 2, 2, '48 - frascos 6 l', Decimal('22'), 53, 0, 0, 0, 'Categoria D'),
 (5, 'Mezcla Gumbo del chef Anton', 2, 2, '36 cajas', Decimal('21'), 0, 0, 0, 1, 'Categoria D')]

In [31]:
#Transformando la informacion a un Dataframe
datosssql=pd.DataFrame(misfilas)
datosssql.head()

                                                   0
0  [1, Té Dharamsala, 1, 1, 10 cajas x 20 bolsas,...
1  [2, Cerveza tibetana Barley, 1, 1, 24 - bot. 1...
2  [3, Sirope de regaliz, 1, 2, 12 - bot. 550 ml,...
3  [4, Especias Cajun del chef Anton, 2, 2, 48 - ...
4  [5, Mezcla Gumbo del chef Anton, 2, 2, 36 caja...

In [32]:
#Metodo Correcto
datossql=pd.DataFrame(np.array(misfilas),
                     columns=["ID",'nombreProducto',"idProveedor","idCategoria","cantidadPorUnidad",
                            'precioUnidad',"unidadesEnExistencia","unidadesEnPedido",
                            "nivelNuevoPedido",'suspendido','categoriaProducto'])
datossql.head()

,ID,nombreProducto,idProveedor,idCategoria,cantidadPorUnidad,precioUnidad,unidadesEnExistencia,unidadesEnPedido,nivelNuevoPedido,suspendido,categoriaProducto
0,1,Té Dharamsala,1,1,10 cajas x 20 bolsas,18,39,0,10,0,Categoria D
1,2,Cerveza tibetana Barley,1,1,24 - bot. 12 l,19,17,40,25,0,Categoria D
2,3,Sirope de regaliz,1,2,12 - bot. 550 ml,10,13,70,25,0,Categoria D
3,4,Especias Cajun del chef Anton,2,2,48 - frascos 6 l,22,53,0,0,0,Categoria D
4,5,Mezcla Gumbo del chef Anton,2,2,36 cajas,21,0,0,0,1,Categoria D

In [33]:
#Cerrando la conexion 
miconexion.close()

**_Motor de BD Postgress_**

In [34]:
miconexion=psycopg2.connect("dbname=profesor user=postgres password=sdc2019PERU host=69.164.192.245")
micursor=miconexion.cursor()
micursor.execute('select * from bupa')
misfilas=micursor.fetchall()
misfilas[0:5]

[(85, 92, 45, 27, 31, 0.0, 1),
 (85, 64, 59, 32, 23, 0.0, 2),
 (86, 54, 33, 16, 54, 0.0, 2),
 (91, 78, 34, 24, 36, 0.0, 2),
 (87, 70, 12, 28, 10, 0.0, 2)]

In [35]:
datospostgres=pd.DataFrame(np.array(misfilas),columns=['V1', 'V2', 'V3', 'V4', 'V5', 'V6', 'V7'])
datospostgres.head()

     V1    V2    V3    V4    V5   V6   V7
0  85.0  92.0  45.0  27.0  31.0  0.0  1.0
1  85.0  64.0  59.0  32.0  23.0  0.0  2.0
2  86.0  54.0  33.0  16.0  54.0  0.0  2.0
3  91.0  78.0  34.0  24.0  36.0  0.0  2.0
4  87.0  70.0  12.0  28.0  10.0  0.0  2.0

In [36]:
#Cerrando la conexion al motor
miconexion.close()